#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.asics_cluster.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics_cluster]
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
module.iam.aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
module.iam.aws_iam_role.codedeploy_role: Refreshing state... [id=codedeploy-role]
data.aws_kms_key.ssm_key_id: Reading...
module.iam.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
module.bff_code_pipeline.aws_codestarconnections_connection.github_connection: Refreshing state... [id=arn:aws:codestar-connections:eu-west-1:802288441694:connection/6696ac39-5472-44bf-b402-443fc22ee162]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-061517c67b227b30c]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
data.aws_kms_key.ssm_key_id: Read complete after 0s [id=3bde2021-54f2-4171-817c-cf644fa4c137]
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
module.iam.aws_iam_role.codebuild_role: Refreshing state... [id=codebuild-role]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_cloudwatch_log_group.gtw_service_log_group: Refreshing state... [id=/ecs/gtw-service]
module.vpc.data.aws_availability_zones.available: Reading...
module.iam.aws_iam_role.codepipeline_role: Refreshing state... [id=codepipeline-role]
module.iam.aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole]
module.iam.aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240905152951292300000007]
module.iam.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240905152951365400000009]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
module.iam.aws_iam_role_policy_attachment.codedeploy_attach: Refreshing state... [id=codedeploy-role-20240905152951221200000005]
module.iam.aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-role:terraform-20240905152951068900000002]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
module.iam.data.aws_iam_policy_document.services_ssm_access: Reading...
module.iam.data.aws_iam_policy_document.services_ssm_access: Read complete after 0s [id=2411191924]
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
aws_cloudwatch_log_stream.gtw_service_log_stream: Refreshing state... [id=gtw-service-log-stream]
module.iam.aws_iam_role_policy_attachment.codebuild_attach: Refreshing state... [id=codebuild-role-20240905152951331600000008]
module.iam.aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-role:terraform-20240905152951089600000003]
module.bff_code_pipeline.aws_codebuild_project.build_project: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/bff-service-code_build_project]
module.iam.aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=EcsAutoScaleRole-20240905152951230800000006]
module.iam.aws_iam_role_policy_attachment.codepipeline_attach: Refreshing state... [id=codepipeline-role-20240905152951204900000004]
module.iam.aws_iam_role_policy.codepipeline_service_role_policy: Refreshing state... [id=codepipeline-role:terraform-20240905152951063500000001]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0cb3a003b39a76317]
module.vpc.aws_internet_gateway.gw: Refreshing state... [id=igw-0458a54ca292f7d3b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b009e3d26af314cc]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06bca612ff40ca56a]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fa599cfaf89baabd]
aws_security_group.gtw_lb: Refreshing state... [id=sg-03acdb2dde66103de]
module.bff_alb.aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/bff-service-tg/6afde97657007567]
module.gtw_alb.aws_lb_target_group.tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/gtw-service-tg/c927e45b813c5abe]
module.vpc.aws_route.internet_access: Refreshing state... [id=r-rtb-0ee3dd4800c8d01201080289494]
module.bff_code_pipeline.aws_codepipeline.codepipeline: Refreshing state... [id=bff-service-pipeline]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
module.gtw_alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/gtw-alb/f7a7254f8bd3d580]
aws_security_group.gtw_ecs_tasks: Refreshing state... [id=sg-0dd6b65a634dded31]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_security_group.lb: Refreshing state... [id=sg-0cec844cd76d5ef4a]
module.bff_alb.aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/bff-alb/f3b49c1d0d2250b9]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-0042fe3d797e6a3c1]
aws_security_group.redis_sg: Refreshing state... [id=sg-03f49e0bfcb8199e4]
module.gtw_alb.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/gtw-alb/f7a7254f8bd3d580/52ba4e4127bc60c3]
module.bff_alb.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/bff-alb/f3b49c1d0d2250b9/6a2877fd19f64867]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]
data.aws_elasticache_replication_group.redis_cluster: Reading...
data.aws_elasticache_replication_group.redis_cluster: Read complete after 1s [id=my-redis-cluster]
module.ecs_gtw.aws_ecs_task_definition.task[0]: Refreshing state... [id=gtw-task]
module.ecs_bff.aws_ecs_task_definition.task[0]: Refreshing state... [id=bff-task]
module.ecs_bff.aws_ecs_service.service[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics_cluster/bff-service]
module.ecs_gtw.aws_ecs_service.service[0]: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/asics_cluster/gtw-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0042fe3d797e6a3c1"
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.gtw_ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "gtw_ecs_tasks" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
        id                     = "sg-0dd6b65a634dded31"
        name                   = "gtw-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # module.ecs_bff.aws_ecs_task_definition.task[0] must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-task:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/bff-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment    = [
                        # (13 unchanged elements hidden)
                        {
                            name  = "CLUTCH_TIME_LIMITER_TIMEOUT_DURATION"
                            value = "2s"
                        },
                      + {
                          + name  = "CONTENTSTACK_BULKHEAD_MAX_CONCURRENT_CALLS"
                          + value = "100"
                        },
                      + {
                          + name  = "CONTENTSTACK_CIRCUIT_BREAKER_FAILURE_RATE_THRESHOLD"
                          + value = "50"
                        },
                      + {
                          + name  = "CONTENTSTACK_CIRCUIT_BREAKER_PERMITTED_NUMBER_OF_CALLS_IN_HALF_OPEN_STATE"
                          + value = "5"
                        },
                      + {
                          + name  = "CONTENTSTACK_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_CLOSED_STATE"
                          + value = "100"
                        },
                      + {
                          + name  = "CONTENTSTACK_CIRCUIT_BREAKER_RING_BUFFER_SIZE_IN_HALF_OPEN_STATE"
                          + value = "10"
                        },
                      + {
                          + name  = "CONTENTSTACK_CIRCUIT_BREAKER_WAIT_DURATION_IN_OPEN_STATE"
                          + value = "30"
                        },
                      + {
                          + name = "CONTENTSTACK_DELIVERY_TOKEN"
                        },
                      + {
                          + name  = "CONTENTSTACK_RATE_LIMITER_CAPACITY"
                          + value = "2"
                        },
                      + {
                          + name  = "CONTENTSTACK_RATE_LIMITER_PERIOD"
                          + value = "60"
                        },
                      + {
                          + name  = "CONTENTSTACK_RATE_LIMITER_TOKENS"
                          + value = "10"
                        },
                      + {
                          + name  = "CONTENTSTACK_RETRY_MAX_ATTEMPTS"
                          + value = "3"
                        },
                      + {
                          + name  = "CONTENTSTACK_RETRY_WAIT_DURATION"
                          + value = "500ms"
                        },
                      + {
                          + name  = "CONTENTSTACK_TIME_LIMITER_TIMEOUT_DURATION"
                          + value = "2"
                        },
                      + {
                          + name  = "CONTENTSTACK_URL"
                          + value = "https://graphql.contentstack.com/stacks/blta941c3d5e669d507?environment=development"
                        },
                        {
                            name  = "GRAPHIQL_ENABLED"
                            value = "false"
                        },
                        # (2 unchanged elements hidden)
                    ]
                  - essential      = true
                  - mountPoints    = []
                    name           = "bff-service"
                  ~ portMappings   = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls = []
                  - volumesFrom    = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "bff-task" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.ecs_gtw.aws_ecs_task_definition.task[0] must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-task:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/gtw-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment    = [
                        {
                            name  = "ASICS_AUTH_CLIENT_ID"
                            value = "one_asics_be_staging"
                        },
                      ~ {
                            name  = "ASICS_AUTH_CLIENT_SECRET"
                          - value = "testttttt"
                        },
                        {
                            name  = "ASICS_AUTH_INTROSPECT_ENDPOINT"
                            value = "https://id-sandbox.asics.com/api/v2/introspect"
                        },
                        # (11 unchanged elements hidden)
                    ]
                  - essential      = true
                  - mountPoints    = []
                    name           = "gtw-service"
                  ~ portMappings   = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - systemControls = []
                  - volumesFrom    = []
                    # (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "gtw-task" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.iam.aws_iam_role_policy.service_ssm_access will be created
  + resource "aws_iam_role_policy" "service_ssm_access" {
      + id     = (known after apply)
      + name   = "ssm-service-access"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:GetParameters"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:eu-west-1:802288441694:parameter/ecs/gtw-service/asics_auth_client_secret",
                          + "arn:aws:ssm:eu-west-1:802288441694:parameter/ecs/bff-service/conntentstack_delivery_token",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:eu-west-1:802288441694:key/3bde2021-54f2-4171-817c-cf644fa4c137"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "ecs-execution-role"
    }

Plan: 3 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*